Revit 2021.1 API
UnitUtils.GetValidUnitTypes Method
 Gets all valid unit types.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `GetAllSpecs()` method instead.")]
public static IList<UnitType> GetValidUnitTypes()
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `GetAllSpecs()` method instead.")> _
Public Shared Function GetValidUnitTypes As IList(Of UnitType)
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `GetAllSpecs()` method instead.")]
public:
static IList<UnitType>^ GetValidUnitTypes()
Return Value
 The valid unit types.
Remarks
 A unit type is considered valid if it is an actual unit type like UT_Length or UT_Angle. Obsolete values and the special values UT_Custom and UT_Undefined are not considered valid.
See Also
UnitUtils Class
Autodesk.Revit.DB Namespace